import re

print("___________Task 1__________\n")
# Регулярные выражения
# 1. Положительное число меньше 300
# Напишите функцию: def is_positive_less_than_300(value):
# Функция должна возвращать True, если строка содержит целое положительное число от 1 до 299.
# Подходят:
# 1
# 15
# 99
# 100
# 299
# Не подходят:
# 0
# 300
# -5
# 3.14
# Abc

#------------------------------------------------------------------
def is_positive_less_than_300(value):
    pattern = r"(?:[1-9]|[1-9][0-9]|[12][0-9]{2})"
    return re.fullmatch(pattern, value) is not None

for value in ["1", "15", "99", "100", "299"]:
    assert is_positive_less_than_300(value)

for value in ["0", "300", "-5", "3.14", "Abc"]:
    assert not is_positive_less_than_300(value)

print("Задача 1: все проверки пройдены!")
# ------------------------------------------------------------------
print()
print("___________Task 2__________\n")
#  2. Число от 1 до 255
# Напишите функцию: def is_number_from_1_to_255(value):
# Функция должна проверять целое число от 1 до 255 включительно.
# Подходят:
# 1
# 25
# 100
# 255
# Не подходят:
# 0
# 256
# 025
# -1
# 2.5

#------------------------------------------------------------------
def is_number_from_1_to_255(value):
    pattern = r"(?:[1-9]|[1-9][0-9]|1[0-9]{2}|2[0-4][0-9]|25[0-5])"
    return re.fullmatch(pattern, value) is not None

for value in ["1", "25", "100", "255"]:
    assert is_number_from_1_to_255(value)

for value in ["0", "256", "025", "-1", "2.5"]:
    assert not is_number_from_1_to_255(value)

print("Задача 2: все проверки пройдены!")
# ------------------------------------------------------------------
print()
print("___________Task 3__________\n")
# 3. Израильский мобильный номер
# Напишите функцию: def is_israel_mobile(phone):
# Допустимы номера:
# 0541234567
# 054-1234567
# +97254-123-4567
# 058-12-34-567
# Не подходят:
# 54-1234567
# 054--12-4567
# +972054-123-4567
# 97254-123-4567

#------------------------------------------------------------------
def is_israel_mobile(phone):
    pattern = r"(?:05[0-9]|\+9725[0-9])(?:-?[0-9]){7}"
    return re.fullmatch(pattern, phone) is not None

for phone in ["0541234567","054-1234567","+97254-123-4567","058-12-34-567"]:
    assert is_israel_mobile(phone)

for phone in ["54-1234567","054--12-4567","+972054-123-4567","97254-1234567"]:
    assert not is_israel_mobile(phone)

print("Задача 3: все проверки пройдены!")
# ------------------------------------------------------------------
print()
print("___________Task 4__________\n")
# 4. Проверка времени
# Напишите функцию: def is_valid_time(time):
# Формат времени: HH:MM (24 часа).
# Подходят:
# 00:00
# 09:30
# 14:45
# 23:59
# Не подходят:
# 24:00
# 12:60
# 8:30
# 123:45
# 12-30

#------------------------------------------------------------------
def is_valid_time(time):
    pattern = r"(?:[01][0-9]|2[0-3]):[0-5][0-9]"
    return re.fullmatch(pattern, time) is not None

for time in ["00:00", "09:30", "14:45", "23:59"]:
    assert is_valid_time(time)

for time in ["24:00", "12:60", "8:30", "123:45", "12-30"]:
    assert not is_valid_time(time)

print("Задача 4: все проверки пройдены!")
# ------------------------------------------------------------------
print()
print("___________Task 5__________\n")
# 5. Advance
# Проверка автомобильного номера Израиля
# Напишите функцию: def is_israel_car_number(number):
# Поддержите два формата:
# 12-345-67
# 123-45-678
# Подходят:
# 12-345-67
# 99-999-99
# 123-45-678
# 456-78-901
# Не подходят:
# 12345678
# 12:345:67
# 1-234-56
# 1234-56-78
#------------------------------------------------------------------
def is_israel_car_number(number):
    pattern = r"(?:[0-9]{2}-[0-9]{3}-[0-9]{2}|[0-9]{3}-[0-9]{2}-[0-9]{3})"
    return re.fullmatch(pattern, number) is not None

for number in ["12-345-67","99-999-99","123-45-678","456-78-901"]:
    assert is_israel_car_number(number)

for number in ["12345678","12:345:67","1-234-56","1234-56-78"]:
    assert not is_israel_car_number(number)

print("Задача 5: все проверки пройдены!")
#------------------------------------------------------------------